// Практические домашние задания для Урока 3
// 1.	Напиши программу, которая запрашивает ввод целого трехзначного числа. Если введенное число заканчивается на 5 и начинается на 2, то программа должна вывести “+”.
// 2.	Напиши программу, которая запрашивает температуру (действительное число), если температура ниже 36,8 - программа должна вывести “Проходите”.
// 3.	Напиши программу, которая запрашивает ввод времени (часы — целое число). Программа считает, что с 20 часов вечера по 6 часов утра темно и если введенное время попадает в этот промежуток, программа должна вывести “*”.
// 4.	Напиши программу, которая запрашивает ввод количества баллов, если количество баллов превышает 60, программа должна вывести “Тест пройден”.
// 5.	Напишите программу, которая по сумме углов в треугольнике определяет, может ли существовать такой треугольник. Программа запрашивает сумму углов треугольника, если такой треугольник может существовать выводит “+”.
// 6.	Напишите программу, которая запрашивает три натуральных числа, если сумма первых двух равно третьему — программа выводит “+”.


