Практические домашние задания для Урока 4: 
Часть I
1.	Напиши программу, которая спрашивает “2+2=?”, если пользователь отвечает “4”- программа выводит на экран “Верно!”. Во всех остальных случаях выводит “Ошибка!”.
2.	Напиши программу, которая запрашивает число и определяет, заканчивается ли оно на 5. Если введенное число заканчивается на 5- программа выводит “+”, иначе выводит “-”.
3.	Напиши программу, которая рассчитывает передвижение шахматной фигуры «ладья». Данная фигура ходит по горизонтали и вертикали на любое количество клеток. Программа запрашивает четыре числа от 1 до 8 каждое. Первые два числа — задают координаты местонахождения ладьи в данный момент (номер строки и столбца), два других числа — координаты клетки, в которую необходимо переместить фигуру (гарантируется, что клетки не совпадают). Программа должна вывести "Да", если из первой клетки ходом ладьи можно попасть во вторую, иначе — "Нет". 
4.	Напиши программу, которая рассчитывает передвижение шахматной фигуры «король». Данная фигура ходит по горизонтали, вертикали или диагонали на одну клетку. Программа запрашивает четыре числа от 1 до 8 каждое. Первые два числа — задают координаты местонахождения короля в данный момент (номер строки и столбца), Два других числа — координаты клетки, в которую необходимо переместить фигуру (гарантируется, что клетки не совпадают). Программа должна вывести "Да", если из первой клетки ходом короля можно попасть во вторую, иначе — "Нет".
5.	 Напиши программу, которая рассчитывает передвижение шахматной фигуры «слон». Данная фигура ходит по диагонали на любое количество клеток. Программа запрашивает четыре числа от 1 до 8 каждое. Первые два числа — задают координаты местонахождения слона в данный момент (номер строки и столбца), Два других числа — координаты клетки, в которую необходимо переместить фигуру (гарантируется, что клетки не совпадают). Программа должна вывести "Да", если из первой клетки ходом слона можно попасть во вторую, иначе — "Нет".
6.	 Напиши программу, которая рассчитывает передвижение шахматной фигуры  «ферзь». Данная фигура ходит по диагонали, горизонтали и вертикали на любое количество клеток. Программа запрашивает четыре числа от 1 до 8 каждое. Первые два числа — задают координаты местонахождения ферзя в данный момент (номер строки и столбца), два вторых числа — координаты клетки, в которую необходимо переместить фигуру (гарантируется, что клетки не совпадают). Программа должна вывести "Да", если из первой клетки ходом ферзя можно попасть во вторую, иначе — "Нет". 
7.	 Напиши программу, которая рассчитывает передвижение шахматной фигуры  «конь». Данная фигура ходит буквой «Г», т.е. две клетки по вертикали в любую из сторон, затем 1 клетку по горизонтали и наоборот. Программа запрашивает четыре числа от 1 до 8 каждое. Первые два числа — задают координаты местонахождения коня в данный момент (номер строки и столбца), два других числа — координаты клетки, в которую необходимо переместить фигуру (гарантируется, что клетки не совпадают). Программа должна вывести "Да", если из первой клетки ходом коня можно попасть во вторую, иначе — "Нет".
8.	 Напиши программу, которая определяет окрашены ли выбранные клетки доски в один цвет или в разные. Программа запрашивает четыре числа от 1 до 8 каждое. Первые два числа — задают координаты первой клетки (номер строки и столбца), вторые — координаты второй клетки (гарантируется, что клетки не совпадают). Программа должна вывести "Да", если выбранные клетки одинакового цвета, иначе — "Нет".

Часть II
1.	Программа запрашивает три целых числа A, B, C (числа вводятся в одной строке через пробел). Определить, есть ли среди них хотя бы одно четное и хотя бы одно нечетное, в этом случае вывести "YES" иначе выведите "NO".
2.	Пользователь вводит N-количество бочек, программа должна вывести  сообщения вида "N bochek". Например, "3 bochki" или "1 bochka".
Напишите программу, которая выбирает правильное слово (из "bochka", "bochek" , "bochki") в зависимости от N (0 ≤ N ≤ 1000).
3.	Напиши программу для службы доставки ресторана. Программа спрашивает “Желаете блюдо дня?”, если клиент отвечает “y”, программа выводит “Заказано блюдо дня”, иначе программа спрашивает “Желаете бизнес-ланч?”, если клиент отвечает “y”- программа выводит “Заказан бизнес-ланч”, иначе выводит “Основное меню”.
4.	Напиши программу, которая запрашивает 3 числа (числа вводятся  в одну строку через пробел), определяет наибольшее и выводит его на экран.
5.	Напиши программу, которая запрашивает стоимость заказа. Если стоимость заказа 1000 и более, то программа должна вывести “Доставка бесплатно.” Иначе программа должна спросить “1. Самовывоз. 2. Доставка курьером.”. Если пользователь вводит 1 - программа должна вывести “Выбран самовывоз”, если 2 “Выбрана доставка курьером”. В конце программа должна вывести сумму заказа с учётом доставки. Доставка курьером увеличивает стоимость заказа на 300 руб., самовывоз увеличивает стоимость заказа на 100 руб. Программа должна вывести стоимость заказа (только цифру).

Часть III
1.	Напиши программу, которая задает вопрос “Кто является автором языка C++? 1. Джеймс Гослинг 2. Бьёрн Страуструп 3. Деннис Ритчи”, пользователь вводит номер ответа, программа в случае верного ответа выводит “Верно”, в случае неверного ответа выводит “Ошибка”, в случае неверного ввода программа должна вывести “Error”.
2.	Напиши программу, которая выдает информацию о начале урока. Программа должна спрашивать пользователя “Какая смена (1 или 2)?”, после того как пользователь выбрал смену, программа должна запросить “Номер урока (1-6)?”. Результатом работы программы будет время начала выбранного урока в выбранной смене. 
1 смена:
1 урок - 8:00
2 урок - 8:50
3 урок - 9:50
4 урок - 10:50
5 урок - 11:50
6 урок - 12:40
2 смена:
1 урок - 14:00
2 урок - 15:50
3 урок - 16:50
4 урок - 17:50
5 урок - 18:50
6 урок - 19:40
3.	Напишите программу, которая будет рассчитывать стоимость пути в зависимости от выбранного типа транспорта. Программа должна запрашивать тип транспорта (1- автомобиль, 2- поезд, 3- самолет) и расстояние.  Стоимость 1 км на автомобиле - 100 руб., на поезде 150 руб., на самолете 200 руб. Программа должна вывести стоимость пути (только цифру).

Часть IV

1.	Напишите программу, которая рассчитывает значение функции f(x) по введенному пользователем значению x: если x>0 f(x)=2*x, если x<0 f(x)=x^2, если x=0 f(x)=0.
2.	Напишите программу, которая подбирает противника сказочному персонажу. Программа должна спрашивать “Выбери героя 1. Иван-Царевич, 2. Илья Муромец 3. Добрыня Никитич 4. Алёша Попович” и выводить на экран противника (Иван-Царевич — Кощей Бессмертный, Илья Муромец — Соловей-Разбойник, Добрыня Никитич — Змей Горыныч, Алёша Попович — Тугарин Змей). Вывести на экран нужно противника, имя героя — не нужно. 


