ЧастьI

1.	Создайте массив из 20 элементов, заполните его следующими значениями: 0, 1, 4, 9, 16, 25… Выведите все элементы массива на экран в одну строку разделяя одним пробелом.
2.	Создайте массив из 20 элементов, заполните его следующими значениями: 0, 1, 8, 27, 64, 125… Замените все элементы с чётными значениями на удвоенное значение элемента. Выведите на экран разность суммы первоначальных элементов и суммы элементов массива с учетом замен.
3.	Создайте массив из 11 элементов, организуйте ввод элементов массива с клавиатуры, выведите на экран все элементы массива в строку разделяя элементы одним пробелом. Инвертируйте элементы массива относительно центра (например если было 0,1,2,3,4,5,6,7,8,9,10, должно стать 10,9,8,7,6,5,4,3,2,1,0). Выведите на экран в новой строке все элементы массива в строку разделяя элементы одним пробелом. 
4.	Создайте массив из 10 элементов, организуйте ввод элементов массива с клавиатуры, выведите на экран количество элементов, бо́льших среднего арифметического значения всех элементов массива.
5.	Создайте три массива по 5 элементов в каждом, организуйте ввод значений элементов первого и второго массива пользователем. Третий массив заполните следующим образом: значению элемента третьего массива присвойте значение большего из соответствующих по номеру элементов первого и второго массива.
Выведите в строку все элементы третьего массива с разделением в один пробел между элементами. В  следующей строке выведите сумму всех элементов третьего массива.


Часть II
1.	Создайте и выведите на экран в виде таблицы двумерный массив (2 знакоместа под один элемент).
1  2  3
4  5  6
7  8  9
2.	Создайте двумерный массив и заполните его значениями. Выведите на экран значение центрального элемента.
1  2  3
4  5  6
7  8  9
3.	Создайте двумерный массив и заполните его значениями. Выведите на экран сумму всех элементов.
1  2  3
4  5  6
7  8  9
4.	Создайте двумерный массив и заполните его значениями. Выведите на экран сумму всех элементов главной диагонали.
1  2  3
4  5  6
7  8  9
5.	Создайте двумерный массив и заполните его значениями. Выведите на экран количество элементов массива больших чем среднее арифметическое значение всех элементов массива.
1  2  3
4  5  6
7  8  9
6.	Создайте двумерный массив и заполните его значениями. Выведите на экран количество чётных элементов массива больших чем среднее арифметическое значение нечётных элементов массива.
1  2  3
4  5  6
7  8  9


Часть III
1.	Дан массив целочисленных значений {192,188, 190, 178, 175, 185}. Напишите программу, которая запрашивает у пользователя значение и если оно есть в массиве выводит “+”, если массив не содержит такого значения — выводит “-”. Организовать поиск элемента оптимальным способом.
2.	На улице расположены дома {1,3,5,7,8,9,10,11,13,15,16,17,19,20}. Напишите программу, которая будет запрашивать у пользователя номер дома, если дом с таким номером есть на улице — вывести “+” иначе вывести”-”. Организовать поиск элемента оптимальным способом.
3.	Напишите программу, которая выстраивает учащихся по росту. В классе учится от 5 до 30 учащихся. Программа должна запрашивать количество учащихся в классе, после чего запрашивать  рост каждого учащегося в классе. В результате вывести в строку через один пробел рост всех учащихся класса в порядке убывания.
